## Plan Result (Demo - TerraformPlanApply)




<pre><code>Plan: 5 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.demo-apps-public-dns.azurerm_dns_cname_record.this[&#34;darts&#34;]
  * module.demo-apps-public-dns.azurerm_dns_cname_record.this[&#34;juror&#34;]
  * module.demo-apps-public-dns.azurerm_dns_cname_record.this[&#34;juror-public&#34;]
  * module.demo-apps-public-dns.azurerm_dns_zone.zone
  * module.demo-apps-public-dns.azurerm_role_assignment.dnszonecontributer




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.demo-apps-public-dns.azurerm_dns_cname_record.this["darts"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "darts"
      + record              = "sdshmcts-demo-d9brfxgseqf0cpen.z01.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "demo.apps.hmcts.net"
    }

  # module.demo-apps-public-dns.azurerm_dns_cname_record.this["juror"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "juror"
      + record              = "sdshmcts-demo-d9brfxgseqf0cpen.z01.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "demo.apps.hmcts.net"
    }

  # module.demo-apps-public-dns.azurerm_dns_cname_record.this["juror-public"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "juror-public"
      + record              = "sdshmcts-demo-d9brfxgseqf0cpen.z01.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "demo.apps.hmcts.net"
    }

  # module.demo-apps-public-dns.azurerm_dns_zone.zone will be created
  + resource "azurerm_dns_zone" "zone" {
      + id                        = (known after apply)
      + max_number_of_record_sets = (known after apply)
      + name                      = "demo.apps.hmcts.net"
      + name_servers              = (known after apply)
      + number_of_record_sets     = (known after apply)
      + resource_group_name       = "reformmgmtrg"

      + soa_record (known after apply)
    }

  # module.demo-apps-public-dns.azurerm_role_assignment.dnszonecontributer will be created
  + resource "azurerm_role_assignment" "dnszonecontributer" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "893dc142-adad-4200-b1d0-30b257f7d7b4"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "DNS Zone Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1881,"Program":"tfcmt","SHA1":"","Target":"Demo - TerraformPlanApply","Vars":{}} -->